src/InformationRegisters/СтатусыПлательщиковЕдиногоНалога/СтатусыПлательщиковЕдиногоНалога.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыПлательщиковЕдиногоНалога</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаПлательщикаЕдиногоНалога</name>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/УчетнаяПолитикаОрганизаций/УчетнаяПолитикаОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаОрганизаций</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>ПлательщикЕН</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УчетнаяПолитика</name>
    <type>
      <types>CatalogRef.УчетныеПолитикиОрганизаций</types>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИННПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерСвидетельстваПлательщикаНДС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлательщикНалогаНаПрибыль</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьГруппаПлательщикаЕдиногоНалога</name>
    <comment>для перехода с УТ 3.1</comment>
    <type>
      <types>EnumRef.ГруппыПлательщиковЕдиногоНалога</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьИнформацияОСтатусеПлательщикаНалогов</name>
    <comment>для перехода с УТ 3.1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаИзмененияУчетнойПолитики</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/СтатусыПлательщиковЕдиногоНалога/ManagerModule.bsl
Процедура АктуализироватьДанные(НаборЗаписейУчетнойПолитики) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтборПоОрганизации = Неопределено;
	Если НаборЗаписейУчетнойПолитики.Отбор.Найти("Организация") <> Неопределено И НаборЗаписейУчетнойПолитики.Отбор.Организация.Использование Тогда
		ОтборПоОрганизации = НаборЗаписейУчетнойПолитики.Отбор.Организация.Значение;
	КонецЕсли;
	
	Запрос = Новый ПостроительЗапроса;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация,
	|	УчетнаяПолитикаОрганизаций.ПлательщикНДС КАК ПлательщикНДС,
	|	УчетнаяПолитикаОрганизаций.ПлательщикЕН КАК ПлательщикЕН,
	|	УчетнаяПолитикаОрганизаций.УчетнаяПолитика.ГруппаПлательщикаЕдиногоНалога КАК ГруппаПлательщикаЕдиногоНалога,
	|	УчетнаяПолитикаОрганизаций.ДатаИзмененияУчетнойПолитики КАК ДатаИзмененияУчетнойПолитики,
	|	УчетнаяПолитикаОрганизаций.Период КАК Период
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций КАК УчетнаяПолитикаОрганизаций
	|		ПО Организации.Ссылка = УчетнаяПолитикаОрганизаций.Организация
	|{ГДЕ
	|	Организации.Ссылка.* КАК Организация}
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период УБЫВ
	|ИТОГИ ПО
	|	Организация";
	
	Если ЗначениеЗаполнено(ОтборПоОрганизации) Тогда
		Запрос.Отбор.Добавить("Организация").Установить(ОтборПоОрганизации);
	КонецЕсли;
	
	Запрос.Выполнить();
	ВыборкаОрганизация = Запрос.Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		НаборЗаписей = РегистрыСведений.СтатусыПлательщиковЕдиногоНалога.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(ВыборкаОрганизация.Организация);
		
		ТекущиеЗначения = Новый Структура("ПлательщикЕН, ПлательщикНДС, ГруппаПлательщикаЕдиногоНалога");
		ДатаПоследнегоИзменения = Неопределено;
		
		Выборка = ВыборкаОрганизация.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если НЕ ЗначениеЗаполнено(Выборка.Период) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Выборка.ДатаИзмененияУчетнойПолитики) Тогда
				ДатаВыборки = Мин(Выборка.Период, Выборка.ДатаИзмененияУчетнойПолитики);
			Иначе         
				ДатаВыборки = Выборка.Период;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДатаПоследнегоИзменения) И ДатаВыборки >= ДатаПоследнегоИзменения Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьОтличия = Ложь;
			Для каждого ЭлементСтруктуры Из ТекущиеЗначения Цикл
				Если ЭлементСтруктуры.Значение <> Выборка[ЭлементСтруктуры.Ключ] Тогда
					ЕстьОтличия = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьОтличия Тогда
				
				ЗаполнитьЗначенияСвойств(ТекущиеЗначения, Выборка);
				
				НоваяЗапись = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяЗапись, ТекущиеЗначения);
				НоваяЗапись.Период = ДатаВыборки;
				НоваяЗапись.Организация = ВыборкаОрганизация.Организация;
				
			Иначе
				
				Если ДатаВыборки < ДатаПоследнегоИзменения Тогда
					НоваяЗапись.Период = ДатаВыборки;
				КонецЕсли;
				
			КонецЕсли;
			
			ДатаПоследнегоИзменения = ДатаВыборки;	
			
		КонецЦикла;
		
		НаборЗаписей.Записать(Истина);
		
	КонецЦикла;
	
КонецПроцедуры
